
class StatusFeedBack:
    ''' TU 消息类型 0x02 的功能定义 '''
    data_field_protocol = {
        11: {
            0: 'DO1',
            1: 'DO2',
            2: 'DO3',
            3: 'DO4',
            4: 'DO5',
            5: 'DO6',
            6: 'DO7',
            7: 'DO8'
        },
        12: {
            0: 'DO9',
            1: 'DO10',
            2: 'DO11',
            3: 'DO12',
            4: 'DO13',
            5: 'DO14',
            6: 'DO15',
            7: 'DO16'
        },
        13: {
            0: 'DO17',
            1: 'DO18',
            2: 'DO19',
            3: 'DO20',
            4: 'DO21',
            5: 'DO22',
            6: 'DO23',
            7: 'DO24'
        },
        '15-16': 'PWM1',
        '17-18': 'PWM2',
        '19-20': 'PWM3',
        '21-22': 'PWM4',
        '23-24': 'PWM5',
        '25-26': 'PWM6',
        '27-28': 'PWM7',
        '29-30': 'PWM8',
        '31-32': 'PWM9',
        '33-34': 'PWM10',
        '35-36': 'PWM11',
        '37-38': 'PWM12',
        '39-40': 'PWM13',
        '41-42': 'PWM14',
        '43-44': 'PWM15',
        '45-46': 'PWM16'
    }

class EbyteConfiguration:
    ''' 亿佰特回包中寄存器(第二字节)的定义'''
    register_define = {
        0x05
    }