# CAN 协议定义
'''
CAN_PROTOCOLS = {
    CAN_ID: {
        Byte: {
            bit: 'function'
        }
    }

    CAN_ID: {
        Byte: {
            length(bit): 'function'
        }
    }
}

'''
CAN_PROTOCOLS = {
    0x9c4: {
        1: {
            0: '引擎启动',
            1: '引擎保持',
            2: '前进档',
            3: '空档',
            4: '后退档',
            5: '加档',
            6: '减档',
            7: '拖车',
        },
        2: {
            0: '驻车刹车',
            1: '急停开关',
            2: '前灯',
            3: '后灯',
            4: '喇叭',
        },
        8: {
            0: '心跳'
        }
    },
    0x9c5: {
        1: {8: '油门'},
        2: {8: '左转'}, 
        3: {8: '右转'}, 
        4: {8: '升臂'}, 
        5: {8: '降臂'}, 
        6: {8: '装料'}, 
        7: {8: '卸料'}, 
        8: {8: '辅助刹车'} 
    },
    0x6: {
        4: {16: '前车桥压力'}
    }
}
print(f'frame_protocol:{CAN_PROTOCOLS.get(0x9c4)}')