# CAN 协议定义
'''
CAN_PROTOCOLS = {
    CAN_ID: {
        Byte: {
            bit: 'function'
        }
    }

    CAN_ID: {
        Byte_num + bit_length: 'function'
    }
}
'''
CAN_PROTOCOLS = {
    ##########################################
    0x9c4: {
        1: {
            0: '引擎启动',
            1: '引擎保持',
            2: '前进档',
            3: '空档',
            4: '后退档',
            5: '加档',
            6: '减档',
            7: '拖车'
        },
        2: {
            0: '驻刹',
            1: '急停',
            2: '前灯',
            3: '后灯',
            4: '喇叭'
        },
        8: {
            0: '心跳'
        }
    },
    0x9c5: {
        9:  '油门',
        10: '左转', 
        11: '右转', 
        12: '升臂', 
        13: '降臂', 
        14: '装料', 
        15: '卸料', 
        16: '辅刹' 
    },
    ##########################################
    0x6: {
        18: '蓄能器压力',
        20: '前车桥压力',
        14: '液压油油位',
        16: '燃油液位'
    },
    0xd: {
        19: '后车桥压力',
        15: '制动油油位'
    },
    0x5: {
        18: '工作压力',
        20: '转向压力'
    },
    0x5df: {
        23: '离合器压力'
    },
    0x5e0: {
        9:  '变矩器油温',
        11: '液压油温度',
        13: '制动油温度',
        23: '车辆速度'
    },
    0x1f7: {
        9:  '机油压力',
        10: '冷却液温度',
        19: '发动机转速',
        21: '单斗重量'
    },
    0xe: {
        30: '空挡输入'
    },
    0x8: {
        2: {
            1: '驻刹',
            2: '急停',
            3: '门关',
            5: '钥匙开关1位'
        }
    },
    0x16: {
        5: {
            6: '遥控模式'
        }
    },
    0x5de: {
        20: '转向角度',
        23: '铲斗角度'
    },
    0x5dc: {
        20: '车体角度-X轴',
        23: '车体角度-Y轴'
    },
    0x5dd: {
        20: '大臂角度-X轴'
    },
    0x1f8: {
        33: '当日重量'
    },
    0x1f5: {
        17: '左前轮胎压',
        19: '右前轮胎压',
        21: '左后轮胎压',
        23: '右后轮胎压'
    },
    0x1f6: {
        2: {
            0: '车辆报警1-冷却液液位',
            1: '车辆报警2-冷却液温度',
            2: '车辆报警3-机油压力',
            3: '车辆报警4-离合器压力',
            4: '车辆报警5-蓄能器压力',
            5: '车辆报警6-液压油液位',
            6: '车辆报警7-制动油液位',
            7: '车辆报警8-火灾报警'
        },
        3: {
            0: '车辆报警9-柴油液位',
            1: '车辆报警10-液压油油温',
            2: '车辆报警11-制动油油温',
            3: '车辆报警12-变矩器油温',
            4: '车辆报警13-传感器短线',
            5: '车辆报警14-发动机黄色报警',
            6: '车辆报警15-发动机红色报警',
            7: '车辆报警16-胎压报警'
        },
        4: {
            0: '车辆报警17-综合报警'
        },
        37: '发动机运行时间'
    },
    0x5e1: {
        9: '实际挡位'
    },
    0x1: {
        1: {
            0: '心跳'
        }
    }
}
