# CAN 协议定义
'''
CAN_PROTOCOLS = {
    CAN_ID: {
        Byte: {
            bit: 'function'
        }
    }

    CAN_ID: {
        Byte_num + bit_length: 'function'
    }
}
'''
CAN_PROTOCOLS = {
    0x9c4: {
        1: {
            0: '引擎启动',
            1: '引擎保持',
            2: '前进档',
            3: '空档',
            4: '后退档',
            5: '加档',
            6: '减档',
            7: '拖车',
        },
        2: {
            0: '驻车刹车',
            1: '急停开关',
            2: '前灯',
            3: '后灯',
            4: '喇叭',
        },
        8: {
            0: '心跳'
        }
    },
    0x9c5: {
        9:  '油门',
        10: '左转', 
        11: '右转', 
        12: '升臂', 
        13: '降臂', 
        14: '装料', 
        15: '卸料', 
        16: '辅刹' 
    },
    0x6: {
        20: '前车桥压力'
    }
}