# OU_UDP 协议
'''
OU_PROTOCOLS = {
    Byte_num: 'Function',

    Byte_num: {
        bit_index: 'Function',
    
        start_bit_index + bit_length * 8: 'Function'
    }
}
'''

OU_PROTOCOLS = {
    ################# (1)号车 #################
    24: '挡位(1)',
    25: {
        0: '智能导向(1)',
        1: '点刹车(1)',
        2: '安全开关左(1)',
        3: '加档(1)',
        4: '减档(1)',
        5: '安全开关右(1)'
    },
    26: {
        0: '平台使能(1)',
        1: '前进挡(1)',
        2: '后退档(1)',
        3: '车辆切换+(1)',
        4: '车辆切换-(1)',
        5: '一键逃逸(1)',
        6: '自动灭火(1)',
        7: '报警屏蔽(1)'
    },
    27: {
        0: '前灯(1)',
        1: '后灯(1)',
        2: '引擎保持(1)',
        3: '引擎启动(1)',
        4: '拖车(1)',
        5: '驻刹(1)',
        6: '急停(1)',
        7: '喇叭(1)'
    },
    ################# (2)号车 #################
    28: '挡位(2)',
    29: {
        0: '智能导向(2)',
        1: '点刹车(2)',
        2: '安全开关左(2)',
        3: '加档(2)',
        4: '减档(2)',
        5: '安全开关右(2)',
        6: '倒矿学习(2)',
        7: '自动倒矿(2)'
    },
    30: {
        0: '平台使能(2)',
        1: '前进挡(2)',
        2: '后退档(2)',
        3: '车辆切换+(2)',
        4: '车辆切换-(2)',
        5: '一键逃逸(2)',
        6: '自动灭火(2)',
        7: '报警屏蔽(2)'
    },
    31: {
        0: '前灯(2)',
        1: '后灯(2)',
        2: '引擎保持(2)',
        3: '引擎启动(2)',
        4: '拖车(2)',
        5: '驻刹(2)',
        6: '急停(2)',
        7: '喇叭(2)'
    },
    ################# 模拟量输入 #################
    34: '左转',
    35: '右转',
    36: '装料',
    37: '卸料',
    38: '降臂',
    39: '升臂',
    40: '油门',
    41: '辅刹',
    ################# OU故障模块 #################
    44: {
        0:  '正常',
        1:  '准备条件不足',
        16: '测试模式'
    },
    45: {
        0: '校准中',
        1: '校准成功',
        16: '校准失败'
    },
    46: {
        0: '左转/右转手柄故障',
        1: '装料/卸料手柄故障',
        2: '升臂/降臂手柄故障',
        3: '油门输入脚踏板故障',
        4: '辅刹脚踏板故障'
    },
    47: {
        0: '左转/右转手柄断线',
        1: '装料/卸料手柄断线',
        2: '升臂/降臂手柄断线',
        3: '油门输入脚踏板断线',
        4: '辅刹输入脚踏板断线'
    },
    ################# 准备条件 #################
    48: {
        0: '左转/右转手柄不在中位',
        1: '装料/卸料手柄不在中位',
        2: '升臂/降臂手柄不在中位',
        3: '油门输入踏板不在中位',
        4: '辅刹输入踏板不在中位',
    },
    49: {
        0: '自主导向按钮不在默认位置',
        1: '点刹车按钮不在默认位置',
        3: '请松开加档按钮',
        4: '请松开减档按钮'
    },
    50: {
        0: '平台使能开关不在默认位置',
        1: '请松开前进档按钮',
        2: '请松开后退档按钮',
        3: '请松开车辆切换+按钮',
        4: '请松开车辆切换-按钮',
        5: '一键逃逸开关不在默认位置',
        6: '一键灭火开关不在默认位置',
        7: '报警屏蔽开关不在默认位置'
    },
    51: {
        2: '熄火开关', # ？？？？？？
        3: '钥匙开关不再默认位置', # ？？？？？？
        4: '请松开拖车按钮',
        5: '驻刹不在默认位置',
        6: '急停开关不在默认位置',
        7: '请松开喇叭'
    }
}
